---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceAllGridRotation
source: html/b4422c46-31af-9a99-22e4-770b9591211b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceAllGridRotation Property

"All Grid Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceAllGridRotation { get; }
```